In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'a' : [ 100,20,30,40,50],'b' : [20,20,15,20,25],'c' : [100000,100,1000,34,45]})
df

     a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45

In [2]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df2 = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df2

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70